# St7SetSoilAutoDrained

Sets the state of the option to Set Undrained elements above waterline to Drained.

long St7SetSoilAutoDrained(long uID, bool Active)

Input Parameters

uID

Strand7 model file ID.

Active

True to set Undrained elements above the water line to Drained.